# IFCProperty Mapping Info Constructor

Source: https://www.revitapidocs.com/2026/b2c73049-ffac-804f-6f0b-fe289aba139f.htm

---

| IFCProperty Mapping Info Constructor |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | IFCPropertyMappingInfo | Constructs a new IFCPropertyMappingInfo with default values. |
|  | IFCPropertyMappingInfo(Boolean, String, ElementId, String) | Constructs a new IFCPropertyMappingInfo with input values.  The flag that indicates whether the property is included in export.  The property name.  The Revit property id.  The Revit property id. |

Top See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace